day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/4_shockTube/shockTube_vanleer/system/functionObject2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

gradient_aposteriori
{
    type                calcFvcGrad;
    functionObjectLibs  ("libFVFunctionObjects.so");

    fieldName "U";
    resultName "gU";    
}

);
