day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/4_shockTube/shockTube_vanleer/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    data
    {
        type    uniform;
        axis    x;
        start   (-4.995 0 0);
        end     (4.995 0 0);
        nPoints 1000;
    }
);

fields          (T mag(U) p);

// ************************************************************************* //
